mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2h4xf/common/s6e2h4xf.h
#define bFM_MFT2_FRT_TCSD_OFMD1                   *((volatile  uint8_t *)(0x42443D80UL))
#define bFM4_MFT2_FRT_TCSD_OFMD1                  *((volatile  uint8_t *)(0x42443D80UL))
#define bFM_MFT2_FRT_TCSD_OFMD2                   *((volatile  uint8_t *)(0x42443D84UL))
#define bFM4_MFT2_FRT_TCSD_OFMD2                  *((volatile  uint8_t *)(0x42443D84UL))

#define bFM_MFT2_ICU_ICSA10_ICE0                  *((volatile  uint8_t *)(0x42443090UL))
#define bFM4_MFT2_ICU_ICSA10_ICE0                 *((volatile  uint8_t *)(0x42443090UL))
#define bFM_MFT2_ICU_ICSA10_ICE1                  *((volatile  uint8_t *)(0x42443094UL))
#define bFM4_MFT2_ICU_ICSA10_ICE1                 *((volatile  uint8_t *)(0x42443094UL))
#define bFM_MFT2_ICU_ICSA10_ICP0                  *((volatile  uint8_t *)(0x42443098UL))
#define bFM4_MFT2_ICU_ICSA10_ICP0                 *((volatile  uint8_t *)(0x42443098UL))
#define bFM_MFT2_ICU_ICSA10_ICP1                  *((volatile  uint8_t *)(0x4244309CUL))
#define bFM4_MFT2_ICU_ICSA10_ICP1                 *((volatile  uint8_t *)(0x4244309CUL))

#define bFM_MFT2_ICU_ICSA32_ICE2                  *((volatile  uint8_t *)(0x42443110UL))
#define bFM4_MFT2_ICU_ICSA32_ICE2                 *((volatile  uint8_t *)(0x42443110UL))
#define bFM_MFT2_ICU_ICSA32_ICE3                  *((volatile  uint8_t *)(0x42443114UL))
#define bFM4_MFT2_ICU_ICSA32_ICE3                 *((volatile  uint8_t *)(0x42443114UL))
#define bFM_MFT2_ICU_ICSA32_ICP2                  *((volatile  uint8_t *)(0x42443118UL))
#define bFM4_MFT2_ICU_ICSA32_ICP2                 *((volatile  uint8_t *)(0x42443118UL))
#define bFM_MFT2_ICU_ICSA32_ICP3                  *((volatile  uint8_t *)(0x4244311CUL))
#define bFM4_MFT2_ICU_ICSA32_ICP3                 *((volatile  uint8_t *)(0x4244311CUL))

#define bFM_MFT2_ICU_ICSB10_IEI0                  *((volatile  uint8_t *)(0x424430A0UL))
#define bFM4_MFT2_ICU_ICSB10_IEI0                 *((volatile  uint8_t *)(0x424430A0UL))
#define bFM_MFT2_ICU_ICSB10_IEI1                  *((volatile  uint8_t *)(0x424430A4UL))
#define bFM4_MFT2_ICU_ICSB10_IEI1                 *((volatile  uint8_t *)(0x424430A4UL))

#define bFM_MFT2_ICU_ICSB32_IEI2                  *((volatile  uint8_t *)(0x42443120UL))
#define bFM4_MFT2_ICU_ICSB32_IEI2                 *((volatile  uint8_t *)(0x42443120UL))
#define bFM_MFT2_ICU_ICSB32_IEI3                  *((volatile  uint8_t *)(0x42443124UL))
#define bFM4_MFT2_ICU_ICSB32_IEI3                 *((volatile  uint8_t *)(0x42443124UL))

#define bFM_MFT2_OCU_OCSA10_CST0                  *((volatile  uint8_t *)(0x42442300UL))
#define bFM4_MFT2_OCU_OCSA10_CST0                 *((volatile  uint8_t *)(0x42442300UL))
#define bFM_MFT2_OCU_OCSA10_CST1                  *((volatile  uint8_t *)(0x42442304UL))
#define bFM4_MFT2_OCU_OCSA10_CST1                 *((volatile  uint8_t *)(0x42442304UL))
#define bFM_MFT2_OCU_OCSA10_IOE0                  *((volatile  uint8_t *)(0x42442310UL))
#define bFM4_MFT2_OCU_OCSA10_IOE0                 *((volatile  uint8_t *)(0x42442310UL))
#define bFM_MFT2_OCU_OCSA10_IOE1                  *((volatile  uint8_t *)(0x42442314UL))
#define bFM4_MFT2_OCU_OCSA10_IOE1                 *((volatile  uint8_t *)(0x42442314UL))
#define bFM_MFT2_OCU_OCSA10_IOP0                  *((volatile  uint8_t *)(0x42442318UL))
#define bFM4_MFT2_OCU_OCSA10_IOP0                 *((volatile  uint8_t *)(0x42442318UL))
#define bFM_MFT2_OCU_OCSA10_IOP1                  *((volatile  uint8_t *)(0x4244231CUL))
#define bFM4_MFT2_OCU_OCSA10_IOP1                 *((volatile  uint8_t *)(0x4244231CUL))

#define bFM_MFT2_OCU_OCSA32_CST2                  *((volatile  uint8_t *)(0x42442380UL))
#define bFM4_MFT2_OCU_OCSA32_CST2                 *((volatile  uint8_t *)(0x42442380UL))
#define bFM_MFT2_OCU_OCSA32_CST3                  *((volatile  uint8_t *)(0x42442384UL))
#define bFM4_MFT2_OCU_OCSA32_CST3                 *((volatile  uint8_t *)(0x42442384UL))
#define bFM_MFT2_OCU_OCSA32_IOE2                  *((volatile  uint8_t *)(0x42442390UL))
#define bFM4_MFT2_OCU_OCSA32_IOE2                 *((volatile  uint8_t *)(0x42442390UL))
#define bFM_MFT2_OCU_OCSA32_IOE3                  *((volatile  uint8_t *)(0x42442394UL))
#define bFM4_MFT2_OCU_OCSA32_IOE3                 *((volatile  uint8_t *)(0x42442394UL))
#define bFM_MFT2_OCU_OCSA32_IOP2                  *((volatile  uint8_t *)(0x42442398UL))
#define bFM4_MFT2_OCU_OCSA32_IOP2                 *((volatile  uint8_t *)(0x42442398UL))
#define bFM_MFT2_OCU_OCSA32_IOP3                  *((volatile  uint8_t *)(0x4244239CUL))
#define bFM4_MFT2_OCU_OCSA32_IOP3                 *((volatile  uint8_t *)(0x4244239CUL))

#define bFM_MFT2_OCU_OCSA54_CST4                  *((volatile  uint8_t *)(0x42442400UL))
#define bFM4_MFT2_OCU_OCSA54_CST4                 *((volatile  uint8_t *)(0x42442400UL))
#define bFM_MFT2_OCU_OCSA54_CST5                  *((volatile  uint8_t *)(0x42442404UL))
#define bFM4_MFT2_OCU_OCSA54_CST5                 *((volatile  uint8_t *)(0x42442404UL))
#define bFM_MFT2_OCU_OCSA54_IOE4                  *((volatile  uint8_t *)(0x42442410UL))
#define bFM4_MFT2_OCU_OCSA54_IOE4                 *((volatile  uint8_t *)(0x42442410UL))
#define bFM_MFT2_OCU_OCSA54_IOE5                  *((volatile  uint8_t *)(0x42442414UL))
#define bFM4_MFT2_OCU_OCSA54_IOE5                 *((volatile  uint8_t *)(0x42442414UL))
#define bFM_MFT2_OCU_OCSA54_IOP4                  *((volatile  uint8_t *)(0x42442418UL))
#define bFM4_MFT2_OCU_OCSA54_IOP4                 *((volatile  uint8_t *)(0x42442418UL))
#define bFM_MFT2_OCU_OCSA54_IOP5                  *((volatile  uint8_t *)(0x4244241CUL))
#define bFM4_MFT2_OCU_OCSA54_IOP5                 *((volatile  uint8_t *)(0x4244241CUL))

#define bFM_MFT2_OCU_OCSB10_OTD0                  *((volatile  uint8_t *)(0x42442320UL))
#define bFM4_MFT2_OCU_OCSB10_OTD0                 *((volatile  uint8_t *)(0x42442320UL))
#define bFM_MFT2_OCU_OCSB10_OTD1                  *((volatile  uint8_t *)(0x42442324UL))
#define bFM4_MFT2_OCU_OCSB10_OTD1                 *((volatile  uint8_t *)(0x42442324UL))
#define bFM_MFT2_OCU_OCSB10_CMOD                  *((volatile  uint8_t *)(0x42442330UL))
#define bFM4_MFT2_OCU_OCSB10_CMOD                 *((volatile  uint8_t *)(0x42442330UL))
#define bFM_MFT2_OCU_OCSB10_FM4                   *((volatile  uint8_t *)(0x4244233CUL))
#define bFM4_MFT2_OCU_OCSB10_FM4                  *((volatile  uint8_t *)(0x4244233CUL))

#define bFM_MFT2_OCU_OCSB32_OTD2                  *((volatile  uint8_t *)(0x424423A0UL))
#define bFM4_MFT2_OCU_OCSB32_OTD2                 *((volatile  uint8_t *)(0x424423A0UL))
#define bFM_MFT2_OCU_OCSB32_OTD3                  *((volatile  uint8_t *)(0x424423A4UL))
#define bFM4_MFT2_OCU_OCSB32_OTD3                 *((volatile  uint8_t *)(0x424423A4UL))
#define bFM_MFT2_OCU_OCSB32_CMOD                  *((volatile  uint8_t *)(0x424423B0UL))
#define bFM4_MFT2_OCU_OCSB32_CMOD                 *((volatile  uint8_t *)(0x424423B0UL))
#define bFM_MFT2_OCU_OCSB32_FM4                   *((volatile  uint8_t *)(0x424423BCUL))
#define bFM4_MFT2_OCU_OCSB32_FM4                  *((volatile  uint8_t *)(0x424423BCUL))

#define bFM_MFT2_OCU_OCSB54_OTD4                  *((volatile  uint8_t *)(0x42442420UL))
#define bFM4_MFT2_OCU_OCSB54_OTD4                 *((volatile  uint8_t *)(0x42442420UL))
#define bFM_MFT2_OCU_OCSB54_OTD5                  *((volatile  uint8_t *)(0x42442424UL))
#define bFM4_MFT2_OCU_OCSB54_OTD5                 *((volatile  uint8_t *)(0x42442424UL))
#define bFM_MFT2_OCU_OCSB54_CMOD                  *((volatile  uint8_t *)(0x42442430UL))
#define bFM4_MFT2_OCU_OCSB54_CMOD                 *((volatile  uint8_t *)(0x42442430UL))
#define bFM_MFT2_OCU_OCSB54_FM4                   *((volatile  uint8_t *)(0x4244243CUL))
#define bFM4_MFT2_OCU_OCSB54_FM4                  *((volatile  uint8_t *)(0x4244243CUL))

#define bFM_MFT2_OCU_OCSC_MOD0                    *((volatile  uint8_t *)(0x424424A0UL))
#define bFM4_MFT2_OCU_OCSC_MOD0                   *((volatile  uint8_t *)(0x424424A0UL))
#define bFM_MFT2_OCU_OCSC_MOD1                    *((volatile  uint8_t *)(0x424424A4UL))
#define bFM4_MFT2_OCU_OCSC_MOD1                   *((volatile  uint8_t *)(0x424424A4UL))
#define bFM_MFT2_OCU_OCSC_MOD2                    *((volatile  uint8_t *)(0x424424A8UL))
#define bFM4_MFT2_OCU_OCSC_MOD2                   *((volatile  uint8_t *)(0x424424A8UL))
#define bFM_MFT2_OCU_OCSC_MOD3                    *((volatile  uint8_t *)(0x424424ACUL))
#define bFM4_MFT2_OCU_OCSC_MOD3                   *((volatile  uint8_t *)(0x424424ACUL))
#define bFM_MFT2_OCU_OCSC_MOD4                    *((volatile  uint8_t *)(0x424424B0UL))
#define bFM4_MFT2_OCU_OCSC_MOD4                   *((volatile  uint8_t *)(0x424424B0UL))
#define bFM_MFT2_OCU_OCSC_MOD5                    *((volatile  uint8_t *)(0x424424B4UL))
#define bFM4_MFT2_OCU_OCSC_MOD5                   *((volatile  uint8_t *)(0x424424B4UL))

